import React from "react";
import ShowMoreCard from "./ShowMoreCard";

const data = [
  {
    id: 1,
    number: "01",
    title:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است؟1",
    desc: "1لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط اساسا مورد استفاده قرار گیرد...",
    href: "/test1",
  },
  {
    id: 2,
    number: "02",
    title:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است؟2",
    desc: "2لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط اساسا مورد استفاده قرار گیرد...",
    href: "/test2",
  },
  {
    id: 3,
    number: "03",
    title:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است؟3",
    desc: "3لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط اساسا مورد استفاده قرار گیرد...",
    href: "/test3",
  },
  {
    id: 4,
    number: "04",
    title:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است؟4",
    desc: "4لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط اساسا مورد استفاده قرار گیرد...",
    href: "/test4",
  },
];

function ShowMoreLessButton() {
  return (
    <div>
      <h1>Read more Read less</h1>
      <div className="flex flex-col gap-5">
        {data.map((item) => (
          <ShowMoreCard
            key={item.id}
            title={item.title}
            number={item.number}
            desc={item.desc}
            href={item.href}
          />
        ))}
      </div>
    </div>
  );
}

export default ShowMoreLessButton;
